In [5]:
import pandas as pd

In [7]:
df = pd.read_csv('time-series.csv')

In [8]:
df.head()

         date      AAPL     MSFT
0  2015-01-02  101.9635  42.5999
1  2015-01-05   99.0910  42.2036
2  2015-01-06   99.1003  41.5886
3  2015-01-07  100.4899  42.1170
4  2015-01-08  104.3510  43.3560

In [12]:
df['AAPL']

0       101.9635
1        99.0910
2        99.1003
3       100.4899
4       104.3510
5       104.4629
6       101.8889
7       102.7935
8       102.4018
9        99.6226
10       98.8485
11      101.3946
12      102.1687
13      104.8266
14      105.3675
15      105.4795
16      101.7863
17      107.5406
18      110.8887
19      109.2659
20      110.6369
21      110.6555
22      111.5042
23      112.3000
24      111.3544
25      112.0941
26      114.2475
27      116.9254
28      118.4047
29      118.9852
          ...
976     191.4100
977     193.5300
978     185.8600
979     176.9800
980     176.7800
981     172.2900
982     174.6200
983     174.2400
984     180.9400
985     179.5500
986     178.5800
987     184.8200
988     176.6900
989     174.7200
990     168.4900
991     169.6000
992     168.6300
993     169.1000
994     170.9500
995     165.4800
996     163.9400
997     166.0700
998     160.8900
999     156.8300
1000    150.7300
1001    146.8300
1002    157.1700
1003    156.1500
1004    156.2300
1005    157.7400
Name: AAPL, Length: 1006, dtype: float64